app/views/participants/_demographics.html.haml

SELECT "other_sites".* FROM "other_sites"
---
    = demographic_f.label :other_site_ids, "In addition to Twitter, I also use the following other internet sites:", :required => false
    = demographic_f.collection_check_boxes :other_site_ids, OtherSite.all.map {|s| [s.id, s.site]}, :first, :last, :required => false