app/controllers/informants_controller.rb

  def show
    @informant = Informant.find(params["id"])
---
SELECT "informants".* FROM "informants" WHERE "informants"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @informant = Informant.find(params["id"])
---
SELECT "informants".* FROM "informants" WHERE "informants"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @informant = Informant.find(params["id"])
---
SELECT "informants".* FROM "informants" WHERE "informants"."id" = ? LIMIT 1  [["id", "1"]]