app/controllers/observers_controller.rb

  def create
    @observer = Observer.create()
---
INSERT INTO "observers" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 18 Dec 2011 23:14:06 UTC +00:00], ["email", nil], ["name", nil], ["updated_at", Sun, 18 Dec 2011 23:14:06 UTC +00:00]]

  def edit
    @observer = Observer.find(params["id"])
---
SELECT "observers".* FROM "observers" WHERE "observers"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @observer = Observer.find(params["id"])
    @observer.update_attributes(params["observer"])
---
SELECT "observers".* FROM "observers" WHERE "observers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "observers" SET "name" = 'Boo face', "email" = 'poo@fa.ce', "updated_at" = '2011-12-18 23:18:35.548522' WHERE "observers"."id" = 1

  def show
    @observer = Observer.find(params["id"])
---
SELECT "observers".* FROM "observers" WHERE "observers"."id" = ? LIMIT 1  [["id", "1"]]