app/controllers/participant_ten_items_controller.rb

  def new
    @observer = Observer.find(params[:observer_id])
---
SELECT "observers".* FROM "observers" WHERE "observers"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    participant_ten_items = ParticipantTenItems.create(params[:participant_ten_items])
    observer = Observer.find(params[:observer_id])
---
INSERT INTO "participant_ten_items" ("anxious", "calm", "conventional", "created_at", "critical", "dependable", "disorganized", "extraverted", "open", "participant_id", "reserved", "subject_id", "subject_type", "sympathetic", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "observers".* FROM "observers" WHERE "observers"."id" = ? LIMIT 1  [["id", "1"]]