app/controllers/participants_controller.rb

SELECT "participants".* FROM "participants" WHERE "participants"."handle" = 'totallyahandle' LIMIT 1
---
  def new
    @handle = params["handle"]
    participant = Participant.find_by_handle(@handle)

INSERT INTO "participants" ("created_at", "email", "handle", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 18 Dec 2011 21:37:58 UTC +00:00], ["email", nil], ["handle", "nmonje"], ["name", nil], ["updated_at", Sun, 18 Dec 2011 21:37:58 UTC +00:00]]
---
  def create
    @participant = Participant.create(params["participant"])

SELECT "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @participant = Participant.find(params["id"])

SELECT "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "participants" SET "email" = 'nick@night.com', "updated_at" = '2011-12-18 21:06:37.979134', "name" = 'somebody' WHERE "participants"."id" = 3
---
  def update
    @participant = Participant.find(params["id"])
    @participant.update_attributes(params["participant"])