app/views/application/_demographics.html.haml

  %p
  = demographic_f.collection_check_boxes :other_site_ids, OtherSite.all.map {|s| [s.id, s.site]}, :first, :last, :required => false
---
SELECT "other_sites".* FROM "other_sites"